# Task2: Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# N = 6 | N = 12 | 32 | 13 | 9 | 18 | 21
# 2 * 3 | 2 * 2 * 3 | 2 * 2 * 2 * 2 * 2 | 13 | 3 * 3 | 2 * 3 * 3 | 3*7


n = int(input("Введите число N = "))

d = 2
list = []
while n != 1:

    if n % d != 0:
        d += 1
    else:
        n = n / d
        list.append(d)

print(list)
